package com.drandarov.hiragana;

/**
 * Comment out the syllables you don't want included!
 *
 * @author lisa-rosenberg
 * @since 23 September 24
 */
class KatakanaDataSet {

    static final String[][] temp = new String[0][0];

    //////////////
    // Katakana //
    //////////////

    static final String[][] katakanaData = new String[][] {
            {"ア", "イ", "ウ", "エ", "オ"},

            {"カ", "キ", "ク", "ケ", "コ"},
            {"ガ", "ギ", "グ", "ゲ", "ゴ"},

            {"サ", "シ", "ス", "セ", "ソ"},
            {"ザ", "ジ", "ズ", "ゼ", "ゾ"},

            {"タ", "チ", "ツ", "テ", "ト"},
            {"ダ", "ヂ", "ヅ", "デ", "ド"},

            {"ナ", "ニ", "ヌ", "ネ", "ノ"},

            {"ハ", "ヒ", "フ", "ヘ", "ホ"},
            {"バ", "ビ", "ブ", "ベ", "ボ"},
            {"パ", "ピ", "プ", "ペ", "ポ"},

            {"マ", "ミ", "ム", "メ", "モ"},

            {"ヤ",       "ユ",       "ヨ"},

            {"ラ", "リ", "ル", "レ", "ロ"},

            {"ワ",                   "ヲ"},

            {"ン"},
    };

    static final String[][] katakanaExtraData = new String[][] {
            {"キャ", "キュ", "キョ"},
            {"ギャ", "ギュ", "ギョ"},

            {"ニャ", "ニュ", "ニョ"},

            {"ヒャ", "ヒュ", "ヒョ"},

            {"ビャ", "ビュ", "ビョ"},
            {"ピャ", "ピュ", "ピョ"},

            {"ミャ", "ミュ", "ミョ"},

            {"リャ", "リュ", "リョ"},

            {"ジャ", "ジュ", "ジェ", "ジョ"},

            {"チャ", "チュ", "チェ", "チョ"},

            {"シャ", "シュ", "シェ", "ショ"},
    };

}
